Revit 2026 API

# CeramicCeramicColor Property

---

The property labeled "Color" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicColor { get; }
```
```vb
Public Shared ReadOnly Property CeramicColor As String
	Get
```
```cpp
public:
static property String^ CeramicColor {
	String^ get ();
}
```
```fsharp
static member CeramicColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace